# EDA (exploratrory data analysis) of car dataset

In [77]:
import pandas as pd
import numpy as np

In [79]:
df = pd.read_csv("car_price_dataset.csv")
df.head()

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867

In [81]:
# 1. Average price of all cars
df["Price"].mean()

8852.9644

In [83]:
# 2. Car brand with the highest average price
df.groupby("Brand")["Price"].mean().idxmax(), df.groupby("Brand")["Price"].mean().max()

('Chevrolet', 9015.683948155533)

In [85]:
# 3. Most common fuel type
df["Fuel_Type"].mode()[0]

'Electric'

In [87]:
# 4. Number of cars with mileage greater than 200,000
df[df["Mileage"] > 200000].shape[0]

3290

In [89]:

# 5. Distribution of cars by transmission type
df["Transmission"].value_counts()

Transmission
Manual            3372
Automatic         3317
Semi-Automatic    3311
Name: count, dtype: int64

In [91]:
# 6. Car model with the highest price
df[df["Price"] == df["Price"].max()][["Brand", "Model", "Price"]]

       Brand    Model  Price
1100  Toyota  Corolla  18301

In [93]:
# 7. Average price of cars by fuel type
df.groupby("Fuel_Type")["Price"].mean()

Fuel_Type
Diesel       8117.336385
Electric    10032.220190
Hybrid       9113.030167
Petrol       8070.561826
Name: Price, dtype: float64

In [95]:
# 8. Number of cars from the year 2020 or later
df[df["Year"] >= 2020].shape[0]

1651

In [97]:
# 9. Average engine size for each brand
df.groupby("Brand")["Engine_Size"].mean()

Brand
Audi          3.032948
BMW           2.976877
Chevrolet     2.993719
Ford          3.044275
Honda         2.925966
Hyundai       2.936683
Kia           3.053791
Mercedes      3.069745
Toyota        2.961443
Volkswagen    3.011078
Name: Engine_Size, dtype: float64

In [99]:
# 10. Car with the lowest mileage
df[df["Mileage"] == df["Mileage"].min()][["Brand", "Model", "Mileage"]]

     Brand     Model  Mileage
6824  Ford  Explorer       25

In [101]:
# 11. Correlation between mileage and price
df["Mileage"].corr(df["Price"])

-0.5512271827629015

In [58]:
# 12. Number of cars with more than 2 owners
df[df["Owner_Count"] > 2].shape[0]

5944

In [60]:
# 13. Average price of cars by year
df.groupby("Year")["Price"].mean()

Year
2000     5393.735369
2001     5904.064039
2002     5956.751082
2003     6225.834646
2004     6330.725888
2005     6943.037123
2006     7249.961446
2007     7632.513953
2008     7728.418848
2009     8083.917293
2010     8503.419954
2011     8622.855234
2012     9011.446224
2013     9114.208531
2014     9587.455635
2015     9896.774648
2016    10177.600000
2017    10343.757506
2018    10939.192941
2019    11132.722090
2020    11495.284337
2021    11637.813299
2022    12067.690176
2023    12169.470982
Name: Price, dtype: float64

In [62]:
# 14. Car with the highest number of doors
df[df["Doors"] == df["Doors"].max()][["Brand", "Model", "Doors"]]

           Brand     Model  Doors
14    Volkswagen      Golf      5
16       Hyundai   Elantra      5
22        Toyota      RAV4      5
26          Audi        A3      5
27           BMW  3 Series      5
...          ...       ...    ...
9978    Mercedes   E-Class      5
9979    Mercedes   C-Class      5
9983    Mercedes   E-Class      5
9991    Mercedes   E-Class      5
9997         BMW  3 Series      5

[2456 rows x 3 columns]

In [64]:
# 15. Average mileage for each fuel type
df.groupby("Fuel_Type")["Mileage"].mean()

Fuel_Type
Diesel      150261.533041
Electric    151059.307429
Hybrid      145577.587036
Petrol      149917.694606
Name: Mileage, dtype: float64

In [66]:
# 16. Number of cars from the brand 'Toyota'
df[df["Brand"] == "Toyota"].shape[0]

970

In [68]:
# 17. Average price of cars with automatic transmission
df[df["Transmission"] == "Automatic"]["Price"].mean()

9938.252939403075

In [70]:
# 18. Car with the highest owner count
df[df["Owner_Count"] == df["Owner_Count"].max()][["Brand", "Model", "Owner_Count"]]

          Brand     Model  Owner_Count
0           Kia       Rio            5
9        Toyota      RAV4            5
30      Hyundai    Tucson            5
33     Mercedes       GLA            5
35          Kia    Optima            5
...         ...       ...          ...
9952   Mercedes       GLA            5
9955        BMW  3 Series            5
9964    Hyundai    Tucson            5
9969  Chevrolet   Equinox            5
9992        BMW  5 Series            5

[2036 rows x 3 columns]

In [72]:
# 19. Average engine size for diesel fuel type
df[df["Fuel_Type"] == "Diesel"]["Engine_Size"].mean()

3.011863057324841

In [74]:
# 20. Number of cars with a price greater than $10,000
df[df["Price"] > 10000].shape[0]

3651